app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("date", "canteen_money", "canteen_card", "store_money", "store_card", "raffle_money", "raffle_card", "donation_money", "donation_card", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @recipe = Recipe.new(recipe_params)

    respond_to do |format|
      if @recipe.save